Repository: ksurikova/ColorBotKids
Catalog: ColorBotKids/Resources/Localizable.xcstrings
Source language: en
Languages: ru, tr

# color_errorMessage_loadingImage
source: We can't load image!
ru: Не удалось загрузить изображение!
tr: Resim yüklenemiyor!

# color_message_loadingImage
source: Loading Drawing...
ru: Загрузка изображения…
tr: Çizim yükleniyor...

# color_message_savingImage
source: Saving your image...
ru: Сохранение изображения...
tr: Resminiz kaydediliyor...

# color_message_successSaving
source: Great job! Your drawing is saved!
ru: Отличная работа! Рисунок сохранён!
tr: Harika! Çiziminiz kaydedildi!

# common_action_allow
source: Allow
ru: Разрешить
tr: İzin Ver

# common_action_allowSave
source: Allow Save
ru: Разрешить сохранение
tr: Kaydetmeye İzin Ver

# common_action_cancel
source: Cancel
ru: Отмена
tr: İptal

# common_action_goBack
source: Go Back
ru: Назад
tr: Geri

# common_action_help
source: Help
ru: Помощь
tr: Yardım

# common_action_openSettings
source: Open Settings
ru: Открыть настройки
tr: Ayarları Aç

# common_action_save
source: Save
ru: Сохранить
tr: Kaydet

# common_action_saveContinue
source: Save & Continue
ru: Сохранить и продолжить
tr: Kaydet ve devam et

# common_action_settings
source: Settings
ru: Настройки
tr: Ayarlar

# common_errorDescription_openSettings
source: Please open Settings manually to grant permissions.
ru: Чтобы предоставить разрешения, откройте «Настройки» вручную.
tr: İzinleri vermek için lütfen Ayarlar'ı manuel olarak açın.

# common_errorMessage_permissionDenied
source: You previously denied %@ access. To enable it: 1. Open Settings (tap button below) 2. Find this app in the list 3. Tap on %@ 4. Enable access
ru: Вы ранее запретили доступ к %@. Чтобы включить его: 1. Откройте «Настройки» (нажмите кнопку ниже) 2. Найдите это приложение в списке 3. Нажмите на %@ 4. Разрешите доступ
tr: Daha önce %@ erişimini reddettiniz. Etkinleştirmek için: 1. Ayarları açın (aşağıdaki düğmeye dokunun) 2. Listeden bu uygulamayı bulun 3. %@ seçeneğine dokunun 4. Erişime izin verin

# common_errorMessage_permissionRestricted
source: This permission is restricted by Screen Time settings. To enable it: 1. Open Settings 2. Go to Screen Time 3. Select Content & Privacy Restrictions 4. Tap on the permission you want to enable 5. Select \"Allow\" for this app
ru: Этот доступ ограничен настройками «Экранное время». Чтобы включить: 1. Откройте «Настройки» 2. Перейдите в «Экранное время» 3. Выберите «Контент и конфиденциальность» 4. Найдите нужное разрешение 5. Установите «Разрешить» для этого приложения
tr: Bu izin, Ekran Süresi ayarları tarafından kısıtlanmış. Etkinleştirmek için: 1. Ayarları açın 2. Ekran Süresi bölümüne gidin 3. İçerik ve Gizlilik Kısıtlamalarını seçin 4. Açmak istediğiniz izni bulun 5. Bu uygulama için \"İzin Ver\" seçeneğini seçin

# common_errorTitle_critical
source: Critical Error
ru: Критическая ошибка
tr: Kritik Hata

# common_errorTitle_openSettings
source: Could Not Open Settings
ru: Не удалось открыть настройки
tr: Ayarlar Açılamadı

# common_errorTitle_permissionDenied
source: Permission Denied
ru: Доступ запрещен
tr: İzin reddedildi

# common_errorTitle_permissionRestricted
source: Screen Time Restrictions
ru: Ограничения экранного времени
tr: Ekran Süresi Kısıtlamaları

# common_message_loading
source: Loading…
ru: Загрузка…
tr: Yükleniyor...

# common_title_optional
source: Optional
ru: Необязательно
tr: İsteğe bağlı

# common_title_required
source: Required
ru: Необходимо
tr: Gerekli

# common_title_restricted
source: Restricted
ru: Ограничено
tr: Sınırlı

# common_title_settings
source: Settings
ru: Настройки
tr: Ayarlar

# common_unknown_error
source: Unknown error
ru: Неизвестная ошибка
tr: Bilinmeyen hata

# configuration_error_corruptedData
source: Saved configuration is corrupted and cannot be loaded.
ru: Сохранённая конфигурация повреждена и не может быть загружена.
tr: Kaydedilmiş yapılandırma bozulmuş ve yüklenemiyor.

# configuration_error_failedToDelete
source: Failed to reset configuration data.
ru: Не удалось сбросить данные конфигурации.
tr: Yapılandırma verileri sıfırlanamadı.

# configuration_error_failedToSave
source: Failed to save configuration.
ru: Не удалось сохранить конфигурацию.
tr: Yapılandırma kaydedilemedi.

# configuration_error_invalidConfiguration
source: Configuration data is invalid or incomplete.
ru: Данные конфигурации некорректны или неполные.
tr: Yapılandırma verileri geçersiz veya eksik.

# confirm_description_save
source: You made something awesome! Want to keep it?
ru: Ты создал нечто потрясающее! Хочешь сохранить это?
tr: Harika bir şey yaptın! Kaydetmek ister misin?

# confirm_title_save
source: Save your drawing?
ru: Сохранить твой рисунок?
tr: Çizimini kaydetmek ister misin?

# confirmation_action_dontSave
source: Don't Save
ru: Не сохранять
tr: Kaydetme

# confirmation_action_keepDrawing
source: Keep Drawing
ru: Продолжить рисовать
tr: Çizmeye Devam Et

# confirmation_action_save
source: Save
ru: Сохранить
tr: Kaydet

# image_generation_error_invalidAPIKey
source: API key is missing or invalid
ru: API ключ отсутствует или невалиден
tr: API anahtarı eksik veya geçersiz

# image_generation_error_invalidResponse
source: Invalid response from server
ru: Неверный ответ от сервера
tr: Sunucudan geçersiz yanıt

# image_generation_error_invalidURL
source: Invalid API endpoint URL
ru: Неверный URL конечной точки API
tr: Geçersiz API uç noktası URL'si

# image_generation_error_noImageData
source: No image data received
ru: Данные изображения не получены
tr: Resim verisi alınmadı

# image_generation_error_rateLimitExceeded
source: Rate limit exceeded. Please try again later
ru: Превышен лимит запросов. Пожалуйста, попробуйте позже
tr: Hız limiti aşıldı. Lütfen daha sonra tekrar deneyin

# image_save_error_invalidImageToSave
source: Unable to save the image. Image is corrupted.
ru: Не удалось сохранить изображение. Изображение повреждено.
tr: Resim kaydedilemedi. Resim bozulmuş.

# image_save_error_noPermission
source: Photo library access is required to save images. You can enable it in Settings or use other sharing options.
ru: Для сохранения изображений требуется доступ к фотопленке. Вы можете включить его в Параметрах или использовать другие параметры общего доступа.
tr: Görüntüleri kaydetmek için Fotoğraf Kütüphanesi erişimi gereklidir. Bunu Ayarlar'da etkinleştirebilir veya diğer paylaşım seçeneklerini kullanabilirsiniz.

# image_save_error_savingIsInterrupted
source: Unable to save the image. Saving process was interrupted.
ru: Не удалось сохранить изображение. Процесс сохранения был прерван.
tr: Resim kaydedilemedi. Kaydetme işlemi kesintiye uğradı.

# image_save_error_unknownError
source: An unexpected error occurred: %@. Please try again.
ru: Произошла непредвиденная ошибка: %@. Пожалуйста, попробуйте еще раз.
tr: Beklenmeyen bir hata oluştu: %@. Lütfen tekrar deneyin.

# keychain_error_readFailed
source: Failed to read from keychain
ru: Не удалось прочитать из связки ключей
tr: Anahtarlıktan okuma başarısız

# keychain_error_saveFailed
source: Failed to save to keychain
ru: Не удалось сохранить в связку ключей
tr: Anahtarlığa kaydetme başarısız

# kid_error_failed_to_play
source: Oops! I can't read it out loud right now. Try again! 📢
ru: Упс! Сейчас не могу прочитать вслух. Попробуй ещё раз! 📢
tr: Hay aksi! Şu an yüksek sesle okuyamıyorum. Tekrar dene! 📢

# kid_message_volumeLow
source: Sound is a little low! Turn it up a bit for the best experience 🔊
ru: Звук немного тихий! Прибавь чуть-чуть для лучшего звучания 🔊
tr: Sesin biraz kısık! Daha iyi duymak için biraz yükselt 🔊

# kid_message_volumeMuted
source: Sound is off! Turn up the volume to hear everything 🔇
ru: Звук выключен! Включи громкость, чтобы всё слышать 🔇
tr: Ses kapalı! Her şeyi duyabilmek için sesi aç 🔇

# kid_message_volumeVeryLow
source: "Your sound is super quiet! Make it louder so you don't miss anything 🔉
ru: Совсем тихо! Сделай погромче, чтобы ничего не пропустить 🔉
tr: Sesin çok kısık! Kaçırmamak için biraz aç 🔉

# main_action_draw
source: Let’s paint!
ru: Давай рисовать!🎨
tr: Resim zamanı!🎨

# main_action_hearAgain
source: Hear Again
ru: Прослушать ещё раз
tr: Tekrar Dinle

# main_action_record
source: Talk to me!
ru: Поговори со мной!
tr: Haydi anlat!

# main_action_stop
source: Ready!
ru: Готово!
tr: Hazır!

# main_message_loadingImage
source: Time for magic! Drawing... ✨
ru: Начинаю колдовать над рисунком! ✨
tr: Şimdi sihir zamanı! Resmini yapıyorum... ✨

# main_prompt_analyzing
source: Writing your words down... ✍️
ru: Записываю твои слова... ✍️

# main_prompt_listening
source: I am hearing you…👂
ru: Слушаю-слушаю…👂
tr: Seni duyuyorum…👂

# main_title_wantToColor
source: I want to color
ru: Хочу раскрасить
tr: Boyamak istiyorum

# onboarding_description_permissions
source: We need these permissions to enable voice recognition
ru: Для включения распознавания голоса нам нужны эти разрешения
tr: Ses tanımayı etkinleştirmek için bu izinlere ihtiyacımız var

# onboarding_description_photoPermissions
source: To save your generated or colored images, please allow access to your Photo Library.
ru: Чтобы сохранить созданные или раскрашенные изображения, предоставьте доступ к вашей фототеке.
tr: Oluşturduğunuz veya renklendirdiğiniz görselleri kaydedebilmek için Fotoğraf Arşivine erişime izin verin.

# onboarding_errorMessage_speechRecognition
source: Speech recognition is not available on this device. This app requires speech recognition to function properly.
ru: Распознавание речи недоступно на этом устройстве. Для корректной работы приложения требуется поддержка распознавания речи.
tr: Bu cihazda konuşma tanıma kullanılamıyor. Uygulamanın düzgün çalışması için konuşma tanıma desteği gereklidir.

# onboarding_footer_openai_apiKey
source: To get an OpenAI API key, visit platform.openai.com → Sign up → API Keys → Create new secret key.
ru: Чтобы получить ключ API OpenAI, перейдите на сайт platform.openai.com → Зарегистрироваться → Ключи API → Создать новый секретный ключ.
tr: OpenAI API anahtarı almak için platform.openai.com adresini ziyaret edin → Kaydolun → API Anahtarları → Yeni gizli anahtar oluşturun.

# onboarding_label_enterApiKey
source: Enter your API key
ru: Введите свой API-ключ
tr: API anahtarınızı girin

# onboarding_label_provider
source: Select provider
ru: Выберите провайдера
tr: Sağlayıcı seçin

# onboarding_message_preparingApp
source: Application is loading…
ru: Подготавливаем ваше приложение…
tr: Uygulamanız hazırlanıyor…

# onboarding_title_AI
source: Setup AI Provider
ru: Настройка AI-провайдера
tr: Yapay zeka sağlayıcısını ayarla

# onboarding_title_permissions
source: Permissions
ru: Разрешения
tr: İzinler

# onboarding_title_photoPermissions
source: Photo Library Access
ru: Доступ к Фото
tr: Fotoğraf Arşivi Erişimi

# onboarding_title_speechConfig
source: Setup Speech Recognition
ru: Настройка распознавания речи
tr: Konuşma Tanıma Kurulumu

# permission_description_microphone
source: To hear your voice descriptions
ru: Чтобы слышать ваши голосовые описания
tr: Sesli açıklamalarınızı duymak için

# permission_description_microphone_infoplist
source: We need to access your microphone to recognize speech.
ru: Нам нужен доступ к вашему микрофону для распознавания речи.
tr: Konuşmayı tanımak için mikrofonunuza erişmemiz gerekir.

# permission_description_photoLibrary
source: To save colored images to your device
ru: Чтобы сохранять раскрашенные изображения на устройство
tr: Renkli görüntüleri cihazınıza kaydetmek için

# permission_description_photoLibrary_infoplist
source: We need to access your Photo Library to save images.
ru: Нам нужен доступ к вашей Фотопленке для сохранения изображений.
tr: Resimleri kaydetmek için Fotoğraf Kütüphanesiyle erişim gerekir.

# permission_description_speech
source: To convert speech into text prompts
ru: Чтобы преобразовывать речь в текстовые подсказки
tr: Konuşmayı metin istemlerine dönüştürmek için

# permission_description_speechRecognition_infoplist
source: We need your permission to use speech recognition.
ru: Нам нужно ваше разрешение на использование распознавания речи.
tr: Konuşma tanımasını kullanmak için izniniz gerekir.

# permission_title_microphone
source: Microphone
ru: Микрофон
tr: Mikrofon

# permission_title_photoLibrary
source: Photo Library
ru: Фотогалерея
tr: Fotoğraf Kütüphanesi

# permission_title_speech
source: Speech Recognition
ru: Распознавание речи
tr: Konuşma Tanıma

# preview_error_message
source: Previewed error message
ru: Cообщениe об ошибке в предварительном просмотре
tr: Önizleme'de hata mesajı

# provider_mock
source: Mock
ru: Тестовый
tr: Sahte

# settings_description_aiImageGeneration
source: Select the AI service that will create the coloring pages. Services require an API key.
ru: Выберите сервис ИИ, который будет создавать раскраски. Сервисы требуют API-ключ.
tr: Boyama sayfalarını oluşturacak yapay zeka hizmetini seçin.Hizmetler API anahtarı gerektirir.

# settings_description_photoPermissions
source: This app requires access to the Photo Library to save your child's artwork.
ru: Для сохранения рисунков вашего ребёнка приложению требуется доступ к Фото.
tr: Çocuğunuzun çizimlerini kaydetmek için uygulamanın Fotoğraf Arşivine erişimi gerekir.

# settings_description_speechLanguage
source: Configure the language for speech recognition and voice feedback.
ru: Настройте язык для распознавания речи и голосовой обратной связи.
tr: Konuşma tanıma ve sesli geri bildirim için dili yapılandırın.

# settings_errorDescription_speech
source: Speech configuration is no compatible with selected locale. Please choose another option.
ru: Сервисы речи несовместимы с выбранным язык. Пожалуйста, выберите другой язык.
tr: Konuşma ayarları seçilen dil uyumlu değil. Lütfen başka bir seçenek belirleyin.

# settings_errorMessage_speech
source: Speech recognition is not available on this device.
ru: Распознавание речи недоступно на этом устройстве.
tr: Bu cihazda konuşma tanıma kullanılamıyor.

# settings_errorTitle_speech
source: Speech Settings Outdated
ru: Настройки речи устарели!
tr: Konuşma Ayarları Güncel Değil

# settings_label_aiImageGeneration
source: AI Image Generation
ru: Генерация изображений с помощью ИИ
tr: Yapay Zeka Görüntü Oluşturma

# settings_label_apiKey
source: API Key
ru: API-ключ
tr: API Anahtarı

# settings_label_autoplay
source: Auto-Play Confirmation
ru: Автоматическое воспроизведение результата
tr: Sonucun Otomatik Olarak Oynatılması

# settings_label_language
source: Language
ru: Язык
tr: Dil

# settings_label_onDeviceRecognition
source: Use On-Device Recognition Only
ru: Использовать только распознавание на устройстве
tr: Sadece Cihaz Üzerinde Tanımayı Kullan

# settings_label_provider
source: Provider
ru: Провайдер
tr: Sağlayıcı

# settings_message_loading
source: Settings Loading…
ru: Загрузка настроек…
tr: Ayarlar Yükleniyor…

# settings_title_photoPermissions
source: Permissions
ru: Разрешения
tr: İzinler

# settings_title_speechLanguage
source: Speech & Language
ru: Речь и язык
tr: Konuşma ve Dil

# settings_warning_onDeviceUnavailable
source: On-device recognition is not available for this language. This setting can't be set.
ru: Распознавание на устройстве недоступно для этого языка. Этот параметр нельзя включить.
tr: Bu dil için cihaz içi tanıma kullanılamaz. Bu ayar etkinleştirilemez.

# settings_warning_ttsUnavailable
source: Text-to-Speech is not available for this language. Voice confirmation will be disabled.
ru: Синтез речи недоступен для этого языка. Озвучивание будет отключено.
tr: Bu dil için Metinden Sese özelliği kullanılamaz. Seslendirme devre dışı bırakılacak.

# speech_recognition_error_notAuthorized
source: Speech recognition is not authorized. Please enable it in Settings.
ru: Распознавание речи не авторизовано. Пожалуйста, включите его в Параметрах.
tr: Konuşma tanıması yetkilendirilmedi. Lütfen Ayarlar'da etkinleştirin.

# speech_recognition_error_recognizerUnavailable
source: Speech recognizer is currently unavailable. Please try again later.
ru: Распознаватель речи в настоящее время недоступен. Пожалуйста, попробуйте позже.
tr: Konuşma tanıyıcı şu anda kullanılamıyor. Lütfen daha sonra tekrar deneyin.

# common_action_ok
source: OK
tr: Tamam
